Autodesk.Revit.DB.Structure.StructuralConnectionMatchType.AddSortOrder(System.Collections.Generic.IList{System.Int32})
Add array of indexes of connected elements describing their order required by the type.
It may contain 1 to N items (where N is the number of connected elements).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionMatchType.#ctor(System.Guid,System.Collections.Generic.IList{System.Collections.Generic.IList{System.Int32}})
Constructs a StructuralConnectionMatchType.
guid:
GUID identifying the type.
sortOrders:
Array of indexes of connected elements describing their order required by the type.
Each array may contain 1 to N items (where N is the number of connected elements).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017